index = {
    '창세기':['Genesis','創世記','創世記'],
    '출애굽기':['Exodus','出埃及記','出エジプト記'],
    '레위기':['Leviticus','利未記','レビ記'],
    '민수기':['Numbers','民數記','民数記'],
    '신명기':['Deuteronomy','申命記','申命記'],
    '여호수아':['Joshua','約書亞記','ヨシュア記'],
    '사사기':['Judges','士師記','士師記'],
    '룻기':['Ruth','路得記','ルツ記'],
    '사무엘상':['1 Samuel','撒母耳記上','サムエル記Ⅰ'],
    '사무엘하':['2 Samuel','撒母耳記下','サムエル記Ⅱ'],
    '열왕기상':['1 Kings','列王紀上','列王記Ⅰ'],
    '열왕기하':['2 Kings','列王紀下','列王記Ⅱ'],
    '역대상':['1 Chronicles','歷代志上','歴代誌Ⅰ'],
    '역대하':['2 Chronicles','歷代志下','歴代誌Ⅱ'],
    '에스라':['Ezra','以斯拉記','エズラ記'],
    '느헤미야':['Nehemiah','尼希米記','ネヘミヤ 記'],
    '에스더':['Esther','以斯帖記','エステル 記'],
    '욥기':['Job','約伯記','ヨブ 記'],
    '시편':['Psalm','詩篇','詩篇'],
    '잠언':['Proverbs','箴言','箴言 知恵の泉'],
    '전도서':['Ecclesiastes','傳道書','伝道者の書'],
    '아가':['Song of Solomon','雅歌','雅歌'],
    '이사야':['Isaiah','以賽亞書','イザヤ書'],
    '예레미야':['Jeremiah','耶利米書','エレミヤ書'],
    '예레미야애가':['Lamentations','耶利米哀歌','哀歌'],
    '에스겔':['Ezekiel','以西結書','エゼキエル書'],
    '다니엘':['Daniel','但以理書','ダニエル書'],
    '호세아':['Hosea','何西阿書','ホセア書'],
    '요엘':['Joel','約珥書','ヨエル書'],
    '아모스':['Amos','阿摩司書','アモス書'],
    '오바댜':['Obadiah','俄巴底亞書','オバデヤ書'],
    '요나':['Jonah','約拿書','ヨナ書'],
    '미가':['Micah','彌迦書','ミカ書'],
    '나훔':['Nahum','那鴻書','ナホム書'],
    '하박국':['Habakkuk','哈巴谷書','ハバクク書'],
    '스바냐':['Zephaniah','西番雅書','ゼパニヤ書'],
    '학개':['Haggai','哈該書','ハガイ書'],
    '스가랴':['Zechariah','撒迦利亞書','ゼカリヤ書'],
    '말라기':['Malachi','瑪拉基書','マラキ書'],
    '마태복음':['Matthew','馬太福音','マタイの福音書'],
    '마가복음':['Mark','馬可福音','マルコの福音書'],
    '누가복음':['Luke','路加福音','ルカの福音書'],
    '요한복음':['John','約翰福音','ヨハネの福音書'],
    '사도행전':['Acts','使徒行傳','使徒の働き'],
    '로마서':['Romans','羅馬書','ローマ人への手紙'],
    '고린도전서':['1 Corinthians','哥林多前書','コリント人への手紙Ⅰ'],
    '고린도후서':['2 Corinthians','哥林多後書','コリント人への手紙Ⅱ'],
    '갈라디아서':['Galatians','加拉太書','ガラテヤ人への手紙'],
    '에베소서':['Ephesians','以弗所書','エペソ人への手紙'],
    '빌립보서':['Philippians','腓立比書','ピリピ人への手紙'],
    '골로새서':['Colossians','歌羅西書','コロサイ人への手紙'],
    '데살로니가전서':['1 Thessalonians','帖撒羅尼迦前書','テサロニケ人への手紙Ⅰ'],
    '데살로니가후서':['2 Thessalonians','帖撒羅尼迦後書','テサロニケ人への手紙Ⅱ'],
    '디모데전서':['1 Timothy','提摩太前書','テモテへの手紙Ⅰ'],
    '디모데후서':['2 Timothy','提摩太後書','テモテへの手紙Ⅱ'],
    '디도서':['Titus','提多書','テトスへの手紙'],
    '빌레몬서':['Philemon','腓利門書','ピレモンへの手紙'],
    '히브리서':['Hebrews','希伯來書','へブル人への手紙'],
    '야고보서':['James','雅各書','ヤコブの手紙'],
    '베드로전서':['1 Peter','彼得前書','ペテロの手紙Ⅰ'],
    '베드로후서':['2 Peter','彼得後書','ペテロの手紙Ⅱ'],
    '요한일서':['1 John','約翰一書','ヨハネの手紙Ⅰ'],
    '요한이서':['2 John','約翰二書','ヨハネの手紙Ⅱ'],
    '요한삼서':['3 John','約翰三書','ヨハネの手紙Ⅲ'],
    '유다서':['Jude','猶大書','ユダの手紙'],
    '요한계시록':['Revelation','啟示錄','ヨハネの黙示録']
}

def getIndexName(name_kr, lang):
    if lang == "kr":
        return name_kr
    elif lang == 'en':
        return index[name_kr][0]
    elif lang == 'cn':
        return index[name_kr][1]
    elif lang == 'jp':
        return index[name_kr][2]

if __name__ == "__main__":
    print(getIndexName('마태복음', 'jp'))
